programming/python/50_Ways.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-05-28 Tue 10:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>50 Ways To Improve Python</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Walter Manger" />
</head>
<body>
<div id="content">
<h1 class="title">50 Ways To Improve Python</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga416ac5">1. Pythonic Thinking</a>
<ul>
<li><a href="#orgf14d78e">1.1. <span class="done DONE">DONE</span> 1. Know Which Version of Python You're Using</a></li>
<li><a href="#org1ef0434">1.2. <span class="done DONE">DONE</span> 2. Follow the PEP (Python Enhancement Proposal) 8 Style Guide</a>
<ul>
<li><a href="#org0b85ecd">1.2.1. Naming</a></li>
<li><a href="#orgd5a0494">1.2.2. Expressions and Statements</a></li>
</ul>
</li>
<li><a href="#orgcc76240">1.3. <span class="todo TODO">TODO</span> 3. Know the Differences Between <code>bytes</code>, <code>str</code>, and <code>unicode</code></a></li>
<li><a href="#orgb92dd2c">1.4. <span class="todo TODO">TODO</span> 4. Write Helper Functions Instead of Complex Expressions</a></li>
<li><a href="#orga20bff0">1.5. <span class="todo TODO">TODO</span> 5. Know how to Slice Sequences</a></li>
<li><a href="#orga6d94a9">1.6. <span class="todo TODO">TODO</span> 6. Avoid Using <code>start</code>, <code>end</code>, and <code>stride</code> in a Single Slice</a></li>
<li><a href="#org929d5c0">1.7. <span class="todo TODO">TODO</span> 7. Use List Comprehensions Instead of <code>map</code> and <code>filter</code></a></li>
<li><a href="#org182b4ea">1.8. <span class="todo TODO">TODO</span> 8. Avoid More Than Two Expressions in List Comprehensions</a></li>
<li><a href="#org569728f">1.9. <span class="todo TODO">TODO</span> 9. Consider Generator Expressions for Large Comprehensions</a></li>
<li><a href="#orge0e168e">1.10. <span class="todo TODO">TODO</span> 10. Prefer <code>enumerate</code> over <code>range</code></a></li>
<li><a href="#org7e238b7">1.11. <span class="todo TODO">TODO</span> 11. Use <code>zip</code> to Process Iterators in Parallel</a></li>
<li><a href="#org5462866">1.12. <span class="todo TODO">TODO</span> 12. Avoid <code>else</code> Blocks After <code>for</code> and <code>while</code> Loops</a></li>
<li><a href="#org8cdc174">1.13. <span class="todo TODO">TODO</span> 13. Take Advantage of Each Block in <code>try/except/else/finally</code></a></li>
</ul>
</li>
<li><a href="#org0bdc80b">2. Functions</a></li>
<li><a href="#org9f8e079">3. Classes and Inheritance</a></li>
<li><a href="#orgec89450">4. Metaclasses and Attributes</a></li>
<li><a href="#org1833562">5. Concurrency and Parallelism</a></li>
<li><a href="#orgc3b86dd">6. Built-in Modules</a></li>
<li><a href="#orga24d342">7. Collaboration</a></li>
<li><a href="#orga8c36e4">8. Production</a></li>
</ul>
</div>
</div>


<div id="outline-container-orga416ac5" class="outline-2">
<h2 id="orga416ac5"><span class="section-number-2">1</span> Pythonic Thinking</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf14d78e" class="outline-3">
<h3 id="orgf14d78e"><span class="section-number-3">1.1</span> <span class="done DONE">DONE</span> 1. Know Which Version of Python You're Using</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-sh">python --version
python3 --version
<span style="color: #4f97d7;">which</span> python
</pre>
</div>
</div>
</div>

<div id="outline-container-org1ef0434" class="outline-3">
<h3 id="org1ef0434"><span class="section-number-3">1.2</span> <span class="done DONE">DONE</span> 2. Follow the PEP (Python Enhancement Proposal) 8 Style Guide</h3>
<div class="outline-text-3" id="text-1-2">
<p>
&gt; Don't do this manually, use a tool like <code>autopep8</code> and <code>pylint</code>.
</p>
</div>

<div id="outline-container-org0b85ecd" class="outline-4">
<h4 id="org0b85ecd"><span class="section-number-4">1.2.1</span> Naming</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>Functions, variables, and attributes should be in <code>lowercase_underscore</code> format.</li>
<li>Protected instance attributes should be in <code>_leading_underscore</code> format.</li>
<li>Private instance attributes should be in <code>__double_leading_underscore</code> format.</li>
<li>Classes and exceptions should be in <code>CapitalizedWord</code> format.</li>
<li>Module-level constants should be in <code>ALL_CAPS</code> format.</li>
<li>Instance methods in classes should use <code>self</code> as the name of the first parameter (which refers to the object).</li>
<li>Class methods should use <code>cls</code> as the name of the first parameter (which refers to the class).</li>
</ul>
</div>
</div>

<div id="outline-container-orgd5a0494" class="outline-4">
<h4 id="orgd5a0494"><span class="section-number-4">1.2.2</span> Expressions and Statements</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>Use inline negation <code>(if a is not b)</code> instead of negation of positive expressions <code>(if not a is b)</code></li>
<li>Don't check for empty values (like <code>[]</code> or <code>''</code>) by checking the length <code>(if len(somelist) =</code> 0=. Use <code>if not somelist</code> and assume empty values implicitly evaluate to <code>False</code>.</li>
<li>The same thing goes for non-empty values (like <code>[1]</code> or <code>'hi'</code>). The statement <code>if somelist</code> is implicitly <code>True</code> for non-empty values.</li>
<li>Avoid single-line <code>if</code> statements, <code>for</code> and <code>while</code> loops, and <code>except</code> compound statements. Spread these over multiple lines for clarity.</li>
<li>Always put <code>import</code> statements at the top of a file.</li>
<li>Always use absolute names for modules when importing them, not names relative to the current module's own path. For example, to import the <code>foo</code> module from the <code>bar</code> package, you should do <code>from bar import foo</code>, not just <code>import foo</code>.</li>
<li>Imports should be in sections in the following order: standard library modules, third=party modules, your own modules. Each subsection should have imports in alphabetical order.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgcc76240" class="outline-3">
<h3 id="orgcc76240"><span class="section-number-3">1.3</span> <span class="todo TODO">TODO</span> 3. Know the Differences Between <code>bytes</code>, <code>str</code>, and <code>unicode</code></h3>
</div>

<div id="outline-container-orgb92dd2c" class="outline-3">
<h3 id="orgb92dd2c"><span class="section-number-3">1.4</span> <span class="todo TODO">TODO</span> 4. Write Helper Functions Instead of Complex Expressions</h3>
</div>

<div id="outline-container-orga20bff0" class="outline-3">
<h3 id="orga20bff0"><span class="section-number-3">1.5</span> <span class="todo TODO">TODO</span> 5. Know how to Slice Sequences</h3>
</div>

<div id="outline-container-orga6d94a9" class="outline-3">
<h3 id="orga6d94a9"><span class="section-number-3">1.6</span> <span class="todo TODO">TODO</span> 6. Avoid Using <code>start</code>, <code>end</code>, and <code>stride</code> in a Single Slice</h3>
</div>

<div id="outline-container-org929d5c0" class="outline-3">
<h3 id="org929d5c0"><span class="section-number-3">1.7</span> <span class="todo TODO">TODO</span> 7. Use List Comprehensions Instead of <code>map</code> and <code>filter</code></h3>
</div>

<div id="outline-container-org182b4ea" class="outline-3">
<h3 id="org182b4ea"><span class="section-number-3">1.8</span> <span class="todo TODO">TODO</span> 8. Avoid More Than Two Expressions in List Comprehensions</h3>
</div>

<div id="outline-container-org569728f" class="outline-3">
<h3 id="org569728f"><span class="section-number-3">1.9</span> <span class="todo TODO">TODO</span> 9. Consider Generator Expressions for Large Comprehensions</h3>
</div>

<div id="outline-container-orge0e168e" class="outline-3">
<h3 id="orge0e168e"><span class="section-number-3">1.10</span> <span class="todo TODO">TODO</span> 10. Prefer <code>enumerate</code> over <code>range</code></h3>
</div>

<div id="outline-container-org7e238b7" class="outline-3">
<h3 id="org7e238b7"><span class="section-number-3">1.11</span> <span class="todo TODO">TODO</span> 11. Use <code>zip</code> to Process Iterators in Parallel</h3>
</div>

<div id="outline-container-org5462866" class="outline-3">
<h3 id="org5462866"><span class="section-number-3">1.12</span> <span class="todo TODO">TODO</span> 12. Avoid <code>else</code> Blocks After <code>for</code> and <code>while</code> Loops</h3>
</div>

<div id="outline-container-org8cdc174" class="outline-3">
<h3 id="org8cdc174"><span class="section-number-3">1.13</span> <span class="todo TODO">TODO</span> 13. Take Advantage of Each Block in <code>try/except/else/finally</code></h3>
</div>
</div>

<div id="outline-container-org0bdc80b" class="outline-2">
<h2 id="org0bdc80b"><span class="section-number-2">2</span> Functions</h2>
</div>

<div id="outline-container-org9f8e079" class="outline-2">
<h2 id="org9f8e079"><span class="section-number-2">3</span> Classes and Inheritance</h2>
</div>

<div id="outline-container-orgec89450" class="outline-2">
<h2 id="orgec89450"><span class="section-number-2">4</span> Metaclasses and Attributes</h2>
</div>

<div id="outline-container-org1833562" class="outline-2">
<h2 id="org1833562"><span class="section-number-2">5</span> Concurrency and Parallelism</h2>
</div>

<div id="outline-container-orgc3b86dd" class="outline-2">
<h2 id="orgc3b86dd"><span class="section-number-2">6</span> Built-in Modules</h2>
</div>

<div id="outline-container-orga24d342" class="outline-2">
<h2 id="orga24d342"><span class="section-number-2">7</span> Collaboration</h2>
</div>

<div id="outline-container-orga8c36e4" class="outline-2">
<h2 id="orga8c36e4"><span class="section-number-2">8</span> Production</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Walter Manger</p>
<p class="date">Created: 2019-05-28 Tue 10:59</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
